假如我们在dev上的工作完成了，就可以把dev合并到master上。
Git怎么合并呢？最简单的方法，就是直接把master指向dev的当前提交，就完成了合并：

# =====================================================

所以Git合并分支也很快！就改改指针，工作区内容也不变！
# =====================================================
合并完分支后，甚至可以删除dev分支。删除dev分支就是把dev指针给删掉，删掉后，我们就剩下了一条master分支：
# =====================================================
下面开始实战。

首先，我们创建dev分支，然后切换到dev分支：

git checkout -b dev

# =====================================================

git checkout命令加上-b参数表示创建并切换，相当于以下两条命令：

$ git branch dev
$ git checkout dev

# =====================================================
然后，用git branch命令查看当前分支：

git branch
* dev
  master
# =====================================================
git add readme.txt 
git commit -m "branch test"
# =====================================================
现在，dev分支的工作完成，我们就可以切换回master分支：

git checkout master
Switched to branch 'master'
# =====================================================
现在，我们把dev分支的工作成果合并到master分支上：

$ git merge dev

Updating 9503173..4823ed6
Fast-forward
 git_Advanced/3_branch.sh    | 49 +++++++++++++++++++++++++++++++++++++++++++++++++
 git_Advanced/branchfile.txt |  1 +
 2 files changed, 50 insertions(+)
 create mode 100644 git_Advanced/3_branch.sh
 create mode 100644 git_Advanced/branchfile.txt
# =====================================================
注意到上面的Fast-forward信息，Git告诉我们，这次合并是“快进模式”，也就是直接把master指向dev的当前提交，所以合并速度非常快。

当然，也不是每次合并都能Fast-forward，我们后面会讲其他方式的合并。

合并完成后，就可以放心地删除dev分支了：
# =====================================================
git branch -d dev
# =====================================================
switch
我们注意到切换分支使用git checkout <branch>，而前面讲过的撤销修改则是git checkout -- <file>，同一个命令，有两种作用，确实有点令人迷惑。

实际上，切换分支这个动作，用switch更科学。因此，最新版本的Git提供了新的git switch命令来切换分支：

# =====================================================
创建并切换到新的dev分支，可以使用：
$ git switch -c dev
# =====================================================
直接切换到已有的master分支，可以使用：
$ git switch master
# =====================================================
小结
Git鼓励大量使用分支：

查看分支：git branch

创建分支：git branch <name>

切换分支：git checkout <name>或者git switch <name>

创建+切换分支：git checkout -b <name>或者git switch -c <name>

合并某分支到当前分支：git merge <name>

删除分支：git branch -d <name>
# =====================================================
# =====================================================
# =====================================================
# =====================================================
# =====================================================
# =====================================================
