假如我们在dev上的工作完成了，就可以把dev合并到master上。
Git怎么合并呢？最简单的方法，就是直接把master指向dev的当前提交，就完成了合并：

# =====================================================

所以Git合并分支也很快！就改改指针，工作区内容也不变！
# =====================================================
合并完分支后，甚至可以删除dev分支。删除dev分支就是把dev指针给删掉，删掉后，我们就剩下了一条master分支：
# =====================================================
下面开始实战。

首先，我们创建dev分支，然后切换到dev分支：

git checkout -b dev

# =====================================================

git checkout命令加上-b参数表示创建并切换，相当于以下两条命令：

$ git branch dev
$ git checkout dev

# =====================================================
然后，用git branch命令查看当前分支：

git branch
* dev
  master
# =====================================================
# =====================================================
# =====================================================
